import sdl2
from догађај.штампа import региструј
from догађај import Обрада
from догађај.мрдачи import Стрелице
from дуњалук import Почетак, Крај, Молер, Прозор, ГлавнаШара, Воденица, ГлавнаПоврш
from шкработине import ШаренаПозадина, Лупа
from шкраб import ЛеденаКоцка, ПлаваКоцка
import dependency_injector.containers as containers
import dependency_injector.providers as providers


class Листа():
    def __init__(бре, *елементи):
        бре.листа = []
        for елемент in елементи:
            бре.листа.append(елемент)

    def __iter__(бре):
        return iter(бре.листа)


class Контејнер(containers.DynamicContainer):
    def __init__(к):
        super().__init__()
        к.ширина = providers.Object(16 * 15)
        к.висина = providers.Object(9 * 15)
        к.почетак = providers.Singleton(Почетак)
        к.прозор = providers.Singleton(Прозор, почетак=к.почетак, наслов="Мрд", ширина=к.ширина, висина=к.висина)
        к.молер = providers.Singleton(Молер, прозор=к.прозор)
        к.крај = providers.Singleton(Крај, прозор=к.прозор, молер=к.молер)
        к.обрада_догађаја = providers.Singleton(Обрада)
        к.главна_шара = providers.Singleton(ГлавнаШара, молер=к.молер, ширина=к.ширина, висина=к.висина)
        к.главна_површ = providers.Singleton(ГлавнаПоврш, ширина=к.ширина, висина=к.висина)
        к.ледена_коцка_положај = providers.Singleton(sdl2.SDL_Point)
        к.ледена_коцка = providers.Singleton(
            ЛеденаКоцка, површ=к.главна_површ, положај=к.ледена_коцка_положај)
        к.плава_коцка = providers.Singleton(
            ПлаваКоцка, главна_површ=к.главна_површ, обрада_догађаја=к.обрада_догађаја)
        к.шарена_позадина = providers.Singleton(ШаренаПозадина, површ=к.главна_површ)
        к.лупа = providers.Singleton(Лупа, главна_површ=к.главна_површ, обрада_догађаја=к.обрада_догађаја)
        к.шкработине = providers.Singleton(Листа, к.шарена_позадина, к.ледена_коцка, к.плава_коцка, к.лупа)
        к.стрелице = providers.Singleton(Стрелице, положај=к.ледена_коцка_положај, обрада_догађаја=к.обрада_догађаја)
        к.мрдачи = providers.Singleton(Листа, к.стрелице)
        к.воденица = providers.Singleton(
            Воденица,
            обрада_догађаја=к.обрада_догађаја,
            шкработине=к.шкработине,
            молер=к.молер,
            главна_шара=к.главна_шара,
            главна_површ=к.главна_површ)


def главна():
    к = Контејнер()
    _, _ = к.почетак(), к.крај()
    обрада_догађаја = к.обрада_догађаја()  # дебуг штампа
    региструј(обрада_догађаја)  # дебуг штампа
    _ = к.мрдачи()
    воденица = к.воденица()
    воденица()


if __name__ == '__main__':
    главна()

