import sdl2
from догађај.штампа import региструј
from догађај import Обрада
from догађај.мрдачи import Стрелице
from дуњалук import Почетак, Крај, Молер, Прозор, ГлавнаШара, Воденица, ГлавнаПоврш
from шкработине import ШаренаПозадина, Лупа
from шкраб import ЛеденаКоцка, ПлаваКоцка
import dependency_injector.containers as containers
import dependency_injector.providers as providers


class Листа():
    def __init__(бре, *елементи):
        бре.листа = []
        for елемент in елементи:
            бре.листа.append(елемент)

    def __iter__(бре):
        return iter(бре.листа)


class Контејнер(containers.DynamicContainer):
    def __init__(к):
        super().__init__()
        к._листови = []
        к.ширина = providers.Object(16 * 15)
        к.висина = providers.Object(9 * 15)
        к.почетак = providers.Singleton(Почетак)
        к.прозор = providers.Singleton(Прозор, почетак=к.почетак, наслов="Мрд", ширина=к.ширина, висина=к.висина)
        к.молер = providers.Singleton(Молер, прозор=к.прозор)
        к.обрада_догађаја = providers.Singleton(Обрада)
        к.главна_шара = providers.Singleton(ГлавнаШара, молер=к.молер, ширина=к.ширина, висина=к.висина)
        к.главна_површ = providers.Singleton(ГлавнаПоврш, ширина=к.ширина, висина=к.висина)
        к.плава_коцка = providers.Singleton(
            ПлаваКоцка, главна_површ=к.главна_површ, обрада_догађаја=к.обрада_догађаја)
        к.шарена_позадина = providers.Singleton(ШаренаПозадина, површ=к.главна_површ)
        к.лупа = providers.Singleton(Лупа, главна_површ=к.главна_површ, обрада_догађаја=к.обрада_догађаја)
        к.шкработине = providers.Singleton(Листа, к.шарена_позадина, к._ледена_коцка(), к.плава_коцка, к.лупа)
        к.воденица = providers.Singleton(
            Воденица,
            обрада_догађаја=к.обрада_догађаја,
            шкработине=к.шкработине,
            молер=к.молер,
            главна_шара=к.главна_шара,
            главна_површ=к.главна_површ)
        к._крај()

    def _крај(к):
        крај = providers.Singleton(Крај, прозор=к.прозор, молер=к.молер)
        к._листови.append(крај)

    def _ледена_коцка(к):
        положај = providers.Singleton(sdl2.SDL_Point)
        ледена_коцка = providers.Singleton(ЛеденаКоцка, површ=к.главна_површ, положај=положај)
        стрелице = providers.Singleton(Стрелице, положај=положај, обрада_догађаја=к.обрада_догађаја)
        к._листови.append(стрелице)
        return ледена_коцка

    def направи_лишђе(к):
        for лист in к._листови:
            лист()


def главна():
    к = Контејнер()
    обрада_догађаја = к.обрада_догађаја()  # дебуг штампа
    региструј(обрада_догађаја)  # дебуг штампа
    воденица = к.воденица()
    к.направи_лишђе()
    воденица()


if __name__ == '__main__':
    главна()

