from догађај.штампа.гејмпад import региструј as гејмпад_региструј
from догађај.штампа.миш import региструј as миш_региструј
from догађај.штампа.остало import региструј as остало_региструј
from догађај.штампа.тастатура import региструј as тастатура_региструј
from догађај.штампа.џојстик import региструј as џојстик_региструј


def региструј(обрада_догађаја):
    гејмпад_региструј(обрада_догађаја)
    миш_региструј(обрада_догађаја)
    остало_региструј(обрада_догађаја)
    тастатура_региструј(обрада_догађаја)
    џојстик_региструј(обрада_догађаја)


__all__ = ["региструј"]

