from догађај.штампа.гејмпад import напуни as гејмпад_напуни
from догађај.штампа.миш import напуни as миш_напуни
from догађај.штампа.остало import напуни as остало_напуни
from догађај.штампа.тастатура import напуни as тастатура_напуни
from догађај.штампа.џојстик import напуни as џојстик_напуни


def напуни(обрада_догађаја):
    гејмпад_напуни(обрада_догађаја)
    миш_напуни(обрада_догађаја)
    остало_напуни(обрада_догађаја)
    тастатура_напуни(обрада_догађаја)
    џојстик_напуни(обрада_догађаја)


def направи():
    штампа_догађаја = {}
    напуни(штампа_догађаја)
    return штампа_догађаја


__all__ = ["направи"]

