import ctypes


class ЛеденаКоцка():
    """ Демонстрита директан приступ пикселима површи """

    def __init__(бре, површ, положај):
        print("ЛеденаКоцка __init__")
        бре.површ = површ
        бре.положај = положај  # претпоставка је да се положај мења споља

    def нашкрабај(бре):
        корак = бре.површ.contents.pitch
        ПА = ctypes.c_ubyte * (бре.површ.contents.h * корак)
        пиксели = ПА.from_address(бре.површ.contents.pixels)
        for y in range(бре.положај.y + 0, бре.положај.y + 16):
            for x in range(бре.положај.x + 0, бре.положај.x + 16):
                index = y * корак + x * 4
                # пиксели[index + 0] = 255  # црвени пиксел не дирамо
                пиксели[index + 1] = 255
                пиксели[index + 2] = 255
                пиксели[index + 3] = 255

